In [6]:
import pandas as pd

In [7]:
purchase_data_df = pd.read_csv("Resources/purchase_data.csv")

In [8]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

In [10]:
Num_players = purchase_data_df["SN"].nunique()
Num_players

576

In [11]:
pd.DataFrame(data=[Num_players], columns=["Total Players"])

   Total Players
0            576

## Purchasing Analysis (Total)
### number of unique items

In [12]:
unique_items = purchase_data_df["Item Name"].nunique()
unique_items

179

### average price

In [187]:
Average = (purchase_data_df["Price"]).mean()
Average

3.050987179487176

### number of purchases

In [188]:
Num_purchase = purchase_data_df["Purchase ID"].value_counts()
Num_purchase

779    1
243    1
265    1
264    1
263    1
      ..
517    1
516    1
515    1
514    1
0      1
Name: Purchase ID, Length: 780, dtype: int64

In [189]:
Total_num = Num_purchase.sum()
Total_num

780

### Total revenue

In [190]:
Total_revenue = purchase_data_df["Price"].sum()
Total_revenue

2379.77

In [191]:
pd.DataFrame(data=[[unique_items, Average, Total_num, Total_revenue]], columns=["Number of Unique Items", "Average Price", "Number of Purchases", "Total Revenue"])

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

## Gender Demographics
### Percentage and Count of Male Players

In [226]:
gender_count = purchase_data_df.groupby("Gender")[["SN"]].nunique()
gender_count

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [227]:
gender_count["SN"]/Num_players

Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
Name: SN, dtype: float64

In [228]:
gender_count["Percentage of Players"] = gender_count["SN"]/Num_players

In [229]:
gender_count

                        SN  Percentage of Players
Gender
Female                  81               0.140625
Male                   484               0.840278
Other / Non-Disclosed   11               0.019097

In [222]:
##gender_count.reset_index(inplace = True)

In [230]:
gender_count

                        SN  Percentage of Players
Gender
Female                  81               0.140625
Male                   484               0.840278
Other / Non-Disclosed   11               0.019097

In [231]:
gender_count.rename(columns={'SN':"Total Count"}, inplace=True)

In [232]:
gender_count

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

In [235]:
gender_count.index.name = None

In [236]:
gender_count

                       Total Count  Percentage of Players
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

## Purchasing Analysis (Gender)

In [240]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [244]:
purchase_count = purchase_data_df.groupby("Gender")[["Purchase ID"]].nunique()
purchase_count

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [247]:
purchase_count.rename(columns= {'Purchase ID': "Purchase Count"}, inplace=True)

In [248]:
purchase_count

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

### Average Purchase Price

In [249]:
Average_purchase_price = purchase_data_df.groupby("Gender")[["Price"]].mean()
Average_purchase_price

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [252]:
Average_purchase_price.rename(columns= {'Price': "Average Purchase Price"}, inplace=True)

In [253]:
Average_purchase_price

                       Average Purchase Price
Gender
Female                               3.203009
Male                                 3.017853
Other / Non-Disclosed                3.346000

### Total Purchase Value

In [254]:
Total_purchase_value = purchase_data_df.groupby("Gender")[["Price"]].sum()
Total_purchase_value

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [255]:
Total_purchase_value.rename(columns= {'Price': "Total Purchase Value"}, inplace=True)

In [256]:
Total_purchase_value

                       Total Purchase Value
Gender
Female                               361.94
Male                                1967.64
Other / Non-Disclosed                 50.19

### Avg Total Purchase per Person

In [259]:
Avg_Total = Total_purchase_value["Total Purchase Value"]/gender_count["Total Count"]
Avg_Total

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [260]:
Avg_Total = Avg_Total.to_frame()

In [261]:
Avg_Total

                              0
Gender
Female                 4.468395
Male                   4.065372
Other / Non-Disclosed  4.562727

In [264]:
Avg_Total.rename(columns= {0: "Avg Total Purchase per Person"}, inplace=True)

In [265]:
Avg_Total

                       Avg Total Purchase per Person
Gender
Female                                      4.468395
Male                                        4.065372
Other / Non-Disclosed                       4.562727

In [266]:
pd.concat([purchase_count, Average_purchase_price, Total_purchase_value, Avg_Total], axis=1)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

##Age Demographics